import unittest
from rk2.1 import *

class TestRK2(unittest.TestCase):

    shops = [
    Shop(1, 'Библио-Глобус'),
    Shop(2, 'Читай - Москва'),
    Shop(3, 'Молодая гвардия'),
    Shop(4, 'Книжный лабиринт'),
    Shop(5, 'Читай - город'),
    ]

    books = [
        Book(1, 'Преступление и наказание', 2, 200),
        Book(2, 'Вишневый сад', 3, 150),
        Book(3, 'Война и мир 1 том', 1, 450),
        Book(4, 'Война и мир 2 том', 5, 300),
        Book(5, 'Война и мир 3 том', 5, 200),
        Book(6, 'Капитанская дочка', 4, 100),
        Book(7, 'Евгений Онегин', 1, 250),
        Book(8, 'Мертвые души', 3, 350),
    ]

    def test1(self):
        self.assertEqual(task_1(books, shops), [('Преступление и наказание','Читай - Москва', 200 ), 
        ('Вишневый сад','Молодая гвардия' , 150), 
        ('Библио-Глобус','Библио-Глобус', 250)])

    def test2(self):
        self.assertEqual(task_2(books, shops), [('Читай - город', 250), 
        ('Молодая гвардия', 250), 
        ('Библио-Глобус', 350)])

    def test3(self):
        self.assertEqual(task_3(books, shops, booksinshops), [('Капитанская дочка', 100,'Молодая гвардия'), 
        ('Война и мир 2 том', 300, 'Читай - Москва')])

if __name__ == '__main__':
    unittest.main()
